### Sidebar: Grouping
page 169

In [4]:
import pandas as pd
from pandas import DataFrame, Series

In [7]:
df = DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100, 'department':'electronics'},
                {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000, 'department':'books'},
                {'product_id':97, 'name':'Pandas Workout','wholesale_price': 35,
                'retail_price':75, 'sales':500, 'department':'books'},
                {'product_id':15, 'name':'banana',
                'wholesale_price': 0.5,
                'retail_price':1, 'sales':200,
                'department':'food'},
                {'product_id':87, 'name':'sandwich',
                'wholesale_price': 3,
                'retail_price':5, 'sales':300,
                'department': 'food'},
                ])

In [8]:
df

,product_id,name,wholesale_price,retail_price,sales,department
0,23,computer,500.0,1000,100,electronics
1,96,Python Workout,35.0,75,1000,books
2,97,Pandas Workout,35.0,75,500,books
3,15,banana,0.5,1,200,food
4,87,sandwich,3.0,5,300,food

In [9]:
# number of products sold in a store
df.count()

product_id         5
name               5
wholesale_price    5
retail_price       5
sales              5
department         5
dtype: int64

In [11]:
df.groupby('department').count()

             product_id  name  wholesale_price  retail_price  sales
department
books                 2     2                2             2      2
electronics           1     1                1             1      1
food                  2     2                2             2      2

In [12]:
df.groupby('department').count()['product_id']

department
books          2
electronics    1
food           2
Name: product_id, dtype: int64

In [13]:
df.groupby('department')['product_id'].count()

department
books          2
electronics    1
food           2
Name: product_id, dtype: int64

In [14]:
df.groupby('department')['retail_price'].mean()

department
books            75.0
electronics    1000.0
food              3.0
Name: retail_price, dtype: float64

In [15]:
df.groupby('department')['retail_price'].agg(['mean', 'std'])

               mean       std
department
books          75.0  0.000000
electronics  1000.0       NaN
food            3.0  2.828427

In [18]:
df.groupby('department').agg(mean_price=('retail_price','mean'),
    std_price=('retail_price','std'),
    max_sales=('sales', 'max')
                            )

             mean_price  std_price  max_sales
department
books              75.0   0.000000       1000
electronics      1000.0        NaN        100
food                3.0   2.828427        300

In [19]:
df.groupby('department', sort=False)['retail_price'].agg(['mean', 'std'])

               mean       std
department
electronics  1000.0       NaN
books          75.0  0.000000
food            3.0  2.828427

In [20]:
df.groupby('department')['retail_price'].agg(['mean', 'std'])

               mean       std
department
books          75.0  0.000000
electronics  1000.0       NaN
food            3.0  2.828427

# Ex 30 - Taxi ride comparison

In [45]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
cols = "passenger_count trip_distance total_amount".split()
df = pd.read_csv('../data/nyc_taxi_2019-01.csv', usecols=cols)

In [3]:
df.head()

   passenger_count  trip_distance  total_amount
0                1            1.5          9.95
1                1            2.6         16.30
2                3            0.0          5.80
3                5            0.0          7.55
4                5            0.0         55.55

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7667792 entries, 0 to 7667791
Data columns (total 3 columns):
 #   Column           Dtype
---  ------           -----
 0   passenger_count  int64
 1   trip_distance    float64
 2   total_amount     float64
dtypes: float64(2), int64(1)
memory usage: 175.5 MB

In [5]:
df.describe()

       passenger_count  trip_distance  total_amount
count     7.667792e+06   7.667792e+06  7.667792e+06
mean      1.567078e+00   2.801084e+00  1.568222e+01
std       1.224431e+00   3.737529e+00  2.622932e+02
min       0.000000e+00   0.000000e+00 -3.628000e+02
25%       1.000000e+00   9.000000e-01  8.190000e+00
50%       1.000000e+00   1.530000e+00  1.127000e+01
75%       2.000000e+00   2.800000e+00  1.656000e+01
max       9.000000e+00   8.318000e+02  6.232617e+05

In [6]:
df['trip_distance'].isna().sum()

0

In [7]:
df['trip_distance'].mean()

2.8010838491706607

In [8]:
df.groupby('passenger_count').agg(mean_ride_cost=('total_amount', 'mean')).sort_values(by='mean_ride_cost')

                 mean_ride_cost
passenger_count
6                     15.437892
5                     15.546940
3                     15.604015
1                     15.609601
4                     15.650307
2                     15.831294
0                     18.663658
9                     31.094444
7                     48.278421
8                     64.105517

In [9]:
df.groupby('passenger_count').agg(mean_ride_cost=('total_amount', 'mean')).sort_index()

                 mean_ride_cost
passenger_count
0                     18.663658
1                     15.609601
2                     15.831294
3                     15.604015
4                     15.650307
5                     15.546940
6                     15.437892
7                     48.278421
8                     64.105517
9                     31.094444

Create a new column, trip_distance_group, in which the values are short (< 2
miles), medium ( 2 miles and 10 miles), and long (> 10 miles).

In [10]:
def group(distance):

    if distance < 2:
        return 'short'
    elif distance <= 10:
        return 'medium'
    else:
        return 'long'

print(group(1.9), group(2), group(8), group(11))

short medium medium long

In [11]:
df['trip_distance_group'] = df['trip_distance'].apply(group)

In [12]:
df.isna().sum()

passenger_count        0
trip_distance          0
total_amount           0
trip_distance_group    0
dtype: int64

In [38]:
dist_grp_1 = df['trip_distance_group'].value_counts()
dist_grp_1

trip_distance_group
short     4749484
medium    2494589
long       423719
Name: count, dtype: int64

In [14]:
df.head()

   passenger_count  trip_distance  total_amount trip_distance_group
0                1            1.5          9.95               short
1                1            2.6         16.30              medium
2                3            0.0          5.80               short
3                5            0.0          7.55               short
4                5            0.0         55.55               short

In [20]:
avg_pass_count_by_trip_1 = df.groupby('trip_distance_group').agg(avg_pass_count = ('passenger_count', 'mean'))
avg_pass_count_by_trip_1

                     avg_pass_count
trip_distance_group
long                       1.590035
medium                     1.576764
short                      1.559943

In [21]:
# Now create a new column, `trip_length`, in which the values will be `short`
# (< 2 miles), `medium` (> 2 miles and <= 10 miles), or `long` (> 10 miles). 
# What was the average number of passengers per trip length category? Sort 
# this result from highest (greatest number of passengers) to lowest
# (smallest number of passengers).
# wrong, or not quite right...

df['trip_distance_group2'] = pd.cut(df['trip_distance'], 
                                   [df['trip_distance'].min(), 2, 10, 
                                    df['trip_distance'].max()],
                                  labels=['short', 'medium', 'long'])

In [24]:
avg_pass_count_by_trip_2 = df.groupby('trip_distance_group2')['passenger_count'].mean().sort_values(ascending=False)
avg_pass_count_by_trip_2

/var/folders/mm/h2z28vhs6cdbnsksl2fzl19w0000gn/T/ipykernel_23148/1986556711.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  avg_pass_count_by_trip_2 = df.groupby('trip_distance_group2')['passenger_count'].mean().sort_values(ascending=False)

trip_distance_group2
long      1.590035
medium    1.585319
short     1.558400
Name: passenger_count, dtype: float64

In [30]:
df_summary = pd.concat([avg_pass_count_by_trip_1, avg_pass_count_by_trip_2], axis=1)
df_summary

        avg_pass_count  passenger_count
long          1.590035         1.590035
medium        1.576764         1.585319
short         1.559943         1.558400

In [39]:
# the given solution assigns 'short' to trips <= 2, not < 2 as required.
dist_grp_2 = df['trip_distance_group2'].value_counts()
dist_grp_2

trip_distance_group2
short     4768416
medium    2420887
long       423719
Name: count, dtype: int64

In [124]:
# the given solution counts the wrong number of trips that are 
# less than 2!
df.loc[df['trip_distance'] < 2].count()

passenger_count         4749484
trip_distance           4749484
total_amount            4749484
trip_distance_group     4749484
trip_distance_group2    4694714
dtype: int64

In [96]:
df.loc[df['trip_distance'] <= 2].count()

passenger_count             4823186
trip_distance               4823186
total_amount                4823186
trip_distance_group         4823186
trip_distance_group2        4768416
trip_distance_group_lte2    4823186
dtype: int64

In [97]:
df.groupby('trip_distance_group2')['passenger_count'].mean().sort_values(ascending=False)

/var/folders/mm/h2z28vhs6cdbnsksl2fzl19w0000gn/T/ipykernel_80895/1512401196.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('trip_distance_group2')['passenger_count'].mean().sort_values(ascending=False)

trip_distance_group2
long      1.590035
medium    1.585319
short     1.558400
Name: passenger_count, dtype: float64

In [33]:
# change function to match given solution, not assigned problem.
def grouplte2(distance):
    if distance <= 2:   # note change from < to <=
        return 'short'
    elif distance < 10:  # changed <= to <
        return 'medium'
    else:
        return 'long'

print(grouplte2(1.9), grouplte2(2), grouplte2(8), grouplte2(10), grouplte2(11))
# now 2.0 miles is a "short" trip

short short medium long long

In [34]:
df['trip_distance_group_lte2'] = df['trip_distance'].apply(grouplte2)

In [41]:
dist_grp_lte2 = df['trip_distance_group_lte2'].value_counts()

In [42]:
dist_grp_lte2

trip_distance_group_lte2
short     4823186
medium    2417543
long       427063
Name: count, dtype: int64

In [40]:
avg_pass_count3 =  df.groupby('trip_distance_group_lte2').agg(avg_pass_count = ('passenger_count', 'mean'))

In [36]:
df_summary = pd.concat([df_summary, avg_pass_count3], axis=1)

In [37]:
df_summary

        avg_pass_count  passenger_count  avg_pass_count
long          1.590035         1.590035        1.587726
medium        1.576764         1.585319        1.585720
short         1.559943         1.558400        1.555906

In [102]:
# Now create a new column, `trip_length`, in which the values will be `short`
# (< 2 miles), `medium` (> 2 miles and <= 10 miles), or `long` (> 10 miles). 
# What was the average number of passengers per trip length category? Sort 
# this result from highest (greatest number of passengers) to lowest
# (smallest number of passengers).

df['trip_distance_group'] = pd.cut(df['trip_distance'], 
                                   [df['trip_distance'].min(), 2, 10, 
                                    df['trip_distance'].max()],
                                  labels=['short', 'medium', 'long'])

df.groupby('trip_distance_group')['passenger_count'].mean().sort_values(ascending=False)

/var/folders/mm/h2z28vhs6cdbnsksl2fzl19w0000gn/T/ipykernel_80895/2812694918.py:12: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('trip_distance_group')['passenger_count'].mean().sort_values(ascending=False)

trip_distance_group
long      1.590035
medium    1.585319
short     1.558400
Name: passenger_count, dtype: float64

In [ ]:
df.apply(pd.Series.value_counts)

In [43]:
pd.concat([dist_grp_1, dist_grp_2, dist_grp_lte2], axis=1)

          count    count    count
short   4749484  4768416  4823186
medium  2494589  2420887  2417543
long     423719   423719   427063

In [57]:
lst = [1.0,1.5,2,2,5,6,10,10,11,13]
df2 = pd.DataFrame(lst, columns=['trip_distance'])
df2

   trip_distance
0            1.0
1            1.5
2            2.0
3            2.0
4            5.0
5            6.0
6           10.0
7           10.0
8           11.0
9           13.0

In [58]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 1 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   trip_distance  10 non-null     float64
dtypes: float64(1)
memory usage: 212.0 bytes

In [63]:
df2['trip_distance'].min()

1.0

In [64]:
df2['trip_distance'].max()

13.0

In [59]:
df2['trip_distance_group_soln'] = pd.cut(df2['trip_distance'], 
                                   [df2['trip_distance'].min(), 2, 10, 
                                    df2['trip_distance'].max()],
                                  labels=['short', 'medium', 'long'])

In [62]:
df2

   trip_distance trip_distance_group_soln
0            1.0                      NaN
1            1.5                    short
2            2.0                    short
3            2.0                    short
4            5.0                   medium
5            6.0                   medium
6           10.0                   medium
7           10.0                   medium
8           11.0                     long
9           13.0                     long

In [60]:
df2['trip_distance_group_soln'].value_counts()

trip_distance_group_soln
medium    4
short     3
long      2
Name: count, dtype: int64

In [65]:
df2['trip_distance_group_soln2'] = pd.cut(df2['trip_distance'], 
                [df2['trip_distance'].min(), 2, 10, 
                df2['trip_distance'].max()],
                labels=['short', 'medium', 'long'],
                include_lowest=True)

In [66]:
df2

   trip_distance trip_distance_group_soln trip_distance_group_soln2
0            1.0                      NaN                     short
1            1.5                    short                     short
2            2.0                    short                     short
3            2.0                    short                     short
4            5.0                   medium                    medium
5            6.0                   medium                    medium
6           10.0                   medium                    medium
7           10.0                   medium                    medium
8           11.0                     long                      long
9           13.0                     long                      long

In [67]:
df2['trip_distance_group_soln'].value_counts()

trip_distance_group_soln
medium    4
short     3
long      2
Name: count, dtype: int64

In [73]:
# pg. 172: Create a new column, trip_distance_group, in which the values are short (< 2
# miles), medium ( 2 miles and 10 miles), and long (> 10 miles). What is the
# average number of passengers per trip length category? Sort this result from
# highest (most passengers) to lowest (fewest passengers).
def group(distance):

    if distance < 2:
        return 'short'
    elif distance <= 10:
        return 'medium'
    else:  # > 10 miles
        return 'long'

print(group(1.9), group(2), group(8), group(10), group(11))

short medium medium medium long

In [69]:
df2['trip_distance_group_spec'] = df2['trip_distance'].apply(group)

In [70]:
df2

,trip_distance,trip_distance_group_soln,trip_distance_group_soln2,trip_distance_group_spec
0,1.0,NaN,short,short
1,1.5,short,short,short
2,2.0,short,short,medium
3,2.0,short,short,medium
4,5.0,medium,medium,medium
5,6.0,medium,medium,medium
6,10.0,medium,medium,medium
7,10.0,medium,medium,medium
8,11.0,long,long,long
9,13.0,long,long,long

In [71]:
df2['trip_distance_group_spec'].value_counts()

trip_distance_group_spec
medium    6
short     2
long      2
Name: count, dtype: int64

### Beyond 1
Create a single data frame containing rides from both January 2019 and Janu-
ary 2020, with a column year indicating which year the ride comes from. Use
groupby to compare the average cost of a taxi in January from each of these two
years.

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
cols = "passenger_count trip_distance total_amount".split()
df2019 = pd.read_csv('../data/nyc_taxi_2019-01.csv', usecols=cols)

In [3]:
df2019['Year'] = 2019
df2019.head()

   passenger_count  trip_distance  total_amount  Year
0                1            1.5          9.95  2019
1                1            2.6         16.30  2019
2                3            0.0          5.80  2019
3                5            0.0          7.55  2019
4                5            0.0         55.55  2019

In [4]:
df2020= pd.read_csv('../data/nyc_taxi_2020-01.csv', usecols=cols)

In [5]:
df2020['Year'] = 2020
df2020.head()

   passenger_count  trip_distance  total_amount  Year
0              1.0            1.2         11.27  2020
1              1.0            1.2         12.30  2020
2              1.0            0.6         10.80  2020
3              1.0            0.8          8.16  2020
4              1.0            0.0          4.80  2020

In [10]:
df = pd.concat([df2019, df2020], axis=0)

In [11]:
df.shape

(14072800, 4)

In [14]:
df.groupby('Year')['total_amount'].mean()

Year
2019    15.682222
2020    18.663149
Name: total_amount, dtype: float64

Create a two-level grouping, first by year and then by passenger_count.

In [15]:
df.groupby(['Year', 'passenger_count']).mean()

                      trip_distance  total_amount
Year passenger_count
2019 0.0                   2.651561     18.663658
     1.0                   2.779088     15.609601
     2.0                   2.880572     15.831294
     3.0                   2.840698     15.604015
     4.0                   2.853084     15.650307
     5.0                   2.865741     15.546940
     6.0                   2.842335     15.437892
     7.0                   2.561579     48.278421
     8.0                   3.142759     64.105517
     9.0                   1.486667     31.094444
2020 0.0                   2.689548     18.059724
     1.0                   2.811050     18.343110
     2.0                   3.001117     19.050504
     3.0                   2.930363     18.736862
     4.0                   2.980372     19.128092
     5.0                   2.850356     18.234443
     6.0                   2.906041     18.367962
     7.0                   3.589655     71.143103
     8.0                   2.960000     58.197059
     9.0                   3.314737     81.244211

The corr method allows us to see how strongly two columns correlate with one
another. Use corr and then sort_values to find which columns have the high-
est correlation.

In [16]:
df.corr()

                 passenger_count  trip_distance  total_amount      Year
passenger_count         1.000000       0.008974     -0.000136 -0.021602
trip_distance           0.008974       1.000000      0.004331  0.001140
total_amount           -0.000136       0.004331      1.000000  0.007657
Year                   -0.021602       0.001140      0.007657  1.000000

## Joining (sidebar, page 177)

In [18]:
products_df = DataFrame([{'product_id':23, 'name':'computer',
    'wholesale_price': 500, 'retail_price':1000, 'department':'electronics'},
    {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
    'retail_price':75, 'department':'books'},
    {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
    'retail_price':75, 'department':'books'}, 
    {'product_id':15, 'name':'banana', 'wholesale_price': 0.5, 
     'retail_price':1, 'department':'food'},
    {'product_id':87, 'name':'sandwich', 'wholesale_price': 3, 
     'retail_price':5, 'department': 'food'},
    ])

In [21]:
sales_df = DataFrame([
    {'product_id': 23, 'date':'2021-August-10', 'quantity':1}, 
    {'product_id': 96, 'date':'2021-August-10', 'quantity':5},
    {'product_id': 15, 'date':'2021-August-10', 'quantity':3},
    {'product_id': 87, 'date':'2021-August-10', 'quantity':2},
    {'product_id': 15, 'date':'2021-August-11', 'quantity':1},
    {'product_id': 96, 'date':'2021-August-11', 'quantity':1},
    {'product_id': 23, 'date':'2021-August-11', 'quantity':2},
    {'product_id': 87, 'date':'2021-August-12', 'quantity':2},
    {'product_id': 97, 'date':'2021-August-12', 'quantity':6},
    {'product_id': 97, 'date':'2021-August-12', 'quantity':1},
    {'product_id': 87, 'date':'2021-August-13', 'quantity':2},
    {'product_id': 23, 'date':'2021-August-13', 'quantity':1},
    {'product_id': 15, 'date':'2021-August-14', 'quantity':2}
    ])

In [27]:
products_df.head()

                      name  wholesale_price  retail_price   department
product_id
23                computer            500.0          1000  electronics
96          Python Workout             35.0            75        books
97          Pandas Workout             35.0            75        books
15                  banana              0.5             1         food
87                sandwich              3.0             5         food

In [23]:
sales_df.head()

   product_id            date  quantity
0          23  2021-August-10         1
1          96  2021-August-10         5
2          15  2021-August-10         3
3          87  2021-August-10         2
4          15  2021-August-11         1

In [31]:
print(f"{sales_df.shape=}, {products_df.shape=}")

sales_df.shape=(13, 2), products_df.shape=(5, 4)

In [25]:
products_df = products_df.set_index('product_id')
sales_df = sales_df.set_index('product_id')

In [32]:
dfps = products_df.join(sales_df)

In [33]:
dfps.shape

(13, 6)

In [34]:
dfps

,name,wholesale_price,retail_price,department,date,quantity
product_id,,,,,,
23,computer,500.0,1000,electronics,2021-August-10,1
23,computer,500.0,1000,electronics,2021-August-11,2
23,computer,500.0,1000,electronics,2021-August-13,1
96,Python Workout,35.0,75,books,2021-August-10,5
96,Python Workout,35.0,75,books,2021-August-11,1
97,Pandas Workout,35.0,75,books,2021-August-12,6
97,Pandas Workout,35.0,75,books,2021-August-12,1
15,banana,0.5,1,food,2021-August-10,3
15,banana,0.5,1,food,2021-August-11,1
15,banana,0.5,1,food,2021-August-14,2
87,sandwich,3.0,5,food,2021-August-10,2
87,sandwich,3.0,5,food,2021-August-12,2
87,sandwich,3.0,5,food,2021-August-13,2

In [37]:
products_df.join(sales_df).groupby('name')['quantity'].sum()

name
Pandas Workout    7
Python Workout    6
banana            6
computer          4
sandwich          6
Name: quantity, dtype: int64

### Or we can determine how much income we get from each product and then sort the products from lowest to highest source of income:

In [38]:
dfps['revenue'] = dfps['retail_price'] * dfps['quantity']

In [44]:
dfps.groupby('name')['revenue'].sum().sort_values(ascending=False)

name
computer          4000
Pandas Workout     525
Python Workout     450
sandwich            30
banana               6
Name: revenue, dtype: int64

In [46]:
# wrong: given solution doesn't reflect quantity sold
products_df.join(sales_df).groupby(
'name')['retail_price'].sum().sort_values()

name
banana               3
sandwich            15
Pandas Workout     150
Python Workout     150
computer          3000
Name: retail_price, dtype: int64